tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU File, Shell, and Text utilities
brew "coreutils"
# C code prettifier
brew "gnu-indent"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU compiler collection
brew "gcc"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GIF image/animation creator/editor
brew "gifsicle"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Utility for directing compilation
brew "make"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Clone of cat with syntax highlighting and Git integration
brew "bat"
# Simplified and community-driven man pages
brew "tldr"
# Kubernetes CLI To Manage Your Clusters In Style
brew "k9s"
# Shell extension to jump to frequently used directories
brew "autojump"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# The best font.
cask "font-cousine-nerd-font"
# Keyboard customizer
cask "karabiner-elements"
# Window manager
cask "tiles"
